# GeomCombination Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombination Class
Members See Also
---
An element created by Join and Cut operations applied to combinable elements in an Autodesk Revit family document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GeomCombination : CombinableElement
```

Visual Basic
---
```text
Public Class GeomCombination _
	Inherits CombinableElement
```

Visual C++
---
```text
public ref class GeomCombination : public CombinableElement
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CombinableElement Autodesk.Revit.DB..::..GeomCombination
# See Also
GeomCombination Members
Autodesk.Revit.DB Namespace